
         var joke=[{id:1,
                  joke: "అక్కయ్య ఏంటీ ఈరోజు బావగారు చాలా కోపంగా ఉన్నారు? ఏమో తమ్ముడూ మీ బావ ఈరోజు పండగని ఏదైనా పిండి వంట చేయమన్నారు. నేను నిమ్మకాయ పిండి, పులిహోర చేశాను. ఆయన చెప్పింది చేసినా.. ఎందుకు కోపంగా ఉన్నారో నాకైతే అర్థం కావడం లేదు."},
                    {id:2,
                    joke:"పంతులు గారు: ఏమయ్యా.. పెళ్లికి అక్షింతలు చల్లమంటే అందరూ కలిసి యూరియా చల్లుతున్నారు, ఏమిటయ్యా ఇదీ? పెళ్లికొడుకు: పెళ్లంటే నూరేళ్ల పంట అంటారుగా పంతులు గారూ.. అందుకే బాగా పండాలని నేనే ఇలా సెట్ చేశా! పంతులు గారు (షాక్ తో): రేయ్.. ఎవర్రా మీరంతా?"
                  },{
                    id:3,
                    joke: "శిష్యుడు: గురువర్యా.. భార్యను అర్థాంగి అని ఎందుకు అంటారు?\n\nగురువు: భర్తను సగం మాత్రమే అర్థం చేసుకొని, అతడి సగం జీవితం బుర్ర పాడు చేస్తుంది కాబట్టి అర్థాంగి అంటారు నాయనా!"
                  },{id:4,
                joke: "బాస్: ఒంట్లో బాగాలేదని పది రోజులు సిక్ లీవ్ అని పెట్టావ్, డాక్టర్ సర్టిఫికెట్ తెమ్మంటే తేవడం లేదు ఎందుకు? ఉద్యోగి: నేను ఆ డాక్టర్ని ఎంత అడిగినా, అది ఆయన కష్టపడి సంపాదించుకున్న సర్టిఫికెట్ అని, ఇవ్వను పొమ్మంటున్నాడు సార్."},
                   {id:4,joke:"ఇంటర్వ్యూ చేసే ఆఫీసర్: మిస్టర్ ఏంటిది? ఇంటర్వ్యూకి వచ్చిన వాడివి కూచుని అడిగిన వాటికి సమాధానాలు చెప్పాలి గాని ఇలా అటూ ఇటూ నడుస్తున్నావేంటి?  అభ్యర్ధి: మీరిచ్చిన ఏడ్ లో వాక్ ఇన్ ఇంటర్వ్యూ అని ఉంది కద సార్. అందుకని "},
                  {id:5,joke:" ఓ రాజకీయ నాయకుడు (సభ ముగిసేక) : ఏంటోయ్ సెక్రటరీ వీళ్ళంతా నా వెనకబడ్డారు? సెక్రటరీ: వెనుక బడిన వాళ్ళందరికీ ఋణాలిప్పిస్తానని ఇప్పుడు మీరే కద సర్ చెప్పేరు. అందుకని....."},
                {id:6,joke:"భర్త: భార్యా భర్తలిద్దరూ జీవితంలో కష్టసుఖాల్ని చెరి సగం పంచుకోవాలి తెలుసా? భార్య: అందుకే కదండీ కష్టసుఖాల్లో మొదటి సగం అంటే కష్టం మీకొదిలేసి రెండో సగం సుఖం నేను పంచుకుంటున్నాను. "},
              {id:7,joke:" ప్రసాదు: ఎమ్మోయ్ రత్నం!! ఈరోజు నిన్ను బయటికి  తీసుకెళ్తాను...... రెడీ అవ్వు ��  రత్నం: క్కడకండి? కూరగాయాల మార్కెట్ కే కదా!!......��  ప్రసాదు: అలా ఎందుకు అంటున్నావు?...��  రత్నం: నేను అడగకుండా తీసుకెళ్లే చోటు అదే కదా...����"},
            {id:8,joke:"ఏంటయ్యా మా ఇంటి ముందు నిలబడి  బిక్షం అడగకుండా వెళ్తున్నావు ఈ రోజు మీ ఇంట్లో వంటలు  బాగోలేదని మా గ్రూలో మెసేజ్ వచ్చింది తల్లీ"}];
    
      
       function load(){
        var id = Math.floor(Math.random()*joke.length); 
       var val=joke[id];
        $("#joke").html(val.joke);
       
       }
       function getRandomColor() {
            // Generate a random RGB color
            const r = Math.floor(Math.random() * 256);
            const g = Math.floor(Math.random() * 256);
            const b = Math.floor(Math.random() * 256);
            return `rgb(${r},${g},${b})`;
        }
       $(document).ready(() => {
        
        load();

        $("#btnclick").click(() => {

            load();
            $("body").css({});
            $("body").css({"color":getRandomColor});
            
        });
       });
